# Data Manipulation With Pandas And Numpy

- df = pd.read_csv("File_name")
- df.head , df.tail
- df.describe , df.dtypes
- df.isnull().any()
- df.isnull().sum()
- df.fillna()
- df.rename(columns={'current_name':'new_name'})     -> renaming columns
- df['new_column_name']=df[column_name].fillna(df['value'].mean()).astype(int)       -> change datatype
- df['new_column_name']=df[column_name].apply(lambda x:x*2)
- Data Aggregating And Grouping
- grouped_mean=df.groupby('Product')['Value'].mean()
- grouped_sum=df.groupby(['Product','Region'])['Value'].sum()
- aggregate multiple functions
- Merging and joining Dataframes
- Merge Datafranme on the 'Key Columns'
- pd.merge(df1,df2,on="Key",how="inner")

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Age': [25, 30, 35, 40, 28],
    'Score': [85, 90, 95, 88, 92]
})
df

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     88
4     Emma   28     92

In [3]:
print(df.head(3))
print("")
print(df.tail(2))

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95

    Name  Age  Score
3  David   40     88
4   Emma   28     92

In [4]:
df.describe()

            Age      Score
count   5.00000   5.000000
mean   31.60000  90.000000
std     5.94138   3.807887
min    25.00000  85.000000
25%    28.00000  88.000000
50%    30.00000  90.000000
75%    35.00000  92.000000
max    40.00000  95.000000

In [5]:
df.dtypes

Name     object
Age       int64
Score     int64
dtype: object

In [6]:
# checking missing colums or values in data
print("currently there is no missing values, if thers : it will show as True")
df.isnull()

currently there is no missing values, if thers : it will show as True

    Name    Age  Score
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [11]:
# deleting a value , not permenently 
df.iloc[1]

Name     Bob
Age       30
Score     90
Name: 1, dtype: object

In [15]:
df.iloc[2]

Name     Charlie
Age           35
Score         95
Name: 2, dtype: object

In [12]:
import numpy as np
df_temp = df.copy()  # keep original safe
df_temp.loc[df_temp['Score'] == 90, 'Score'] = np.nan
df

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     88
4     Emma   28     92

In [16]:
df.isnull().any(axis=1)

0    False
1    False
2    False
3    False
4    False
dtype: bool